##################################################################################
# Задания от 10 до 20
# Задание 11
# Выведите первый и последний элемент списка.
def Task_11():
    lst = [1, 2, 3, 4, 5]
    print(f'Первый: {lst[0]}; последний: {lst[-1]}')

#Task_11()
# Easy

##################################################################################
# Напишите программу, которая принимает имя файла и выводит его расширение.
# Если расширение у файла определить невозможно, выбросите исключение.
def Task_12(filename):
    try:
        filename_parts = filename.split('.')
        print("Расширение файла:",filename_parts[-1])

    except:
        print("Не удалось определить расширение")

# Task_12(filename="text.txt")

##################################################################################
# Задача 13
# При заданном целом числе n посчитайте n + nn + nnn.
def Task_13(n):
    n1 = n
    n2 = int(n * 2)
    n3 = int(n * 3)
    print(n1 + n2 + n3)

# Task_13(11)


##################################################################################
# Напишите программу, которая выводит чётные числа
# из заданного списка и останавливается,
# если встречает число 237.
def Task_14():
    numbers = [
        386, 462, 47, 418, 907, 344, 236, 375, 823, 566, 597, 978, 328, 615, 953, 345,
        399, 162, 758, 219, 918, 237, 412, 566, 826, 248, 866, 950, 626, 949, 687, 217,
    ]

    for x in numbers:
        if x == 237:
            break
        elif x % 2 == 0:
            print(x)

# Task_14()

##################################################################################
# Задача 15
# Напишите программу, которая принимает два списка и
# выводит все элементы первого, которых нет во втором.
def Task_15():
    lint_1 = set(['White', 'Black', 'Red'])
    list_2 = set(['Red', 'Green', 'Blue'])

    print(lint_1 - list_2)

# Task_15()

##################################################################################
# Задача 16
# Выведите список файлов в указанной директории.
def Task_16():
    import os

    direct = r'C:\Users'
    _direct = os.listdir(direct)
    print(_direct)

# Task_16()

##################################################################################
# Задача 17
# Сложите цифры целого числа.
def Task_17(num):
    _num = sum(num)
    print(_num)


numbers = [1,2,3,4,5,6,7,8,9,10]
# Task_17(numbers)

##################################################################################
# Задача 18
# Посчитайте, сколько раз символ встречается в строке.
def Task_18(str):
    _str = str.count('o')
    print(_str)

# Task_18("This is easy ooo thre")

##################################################################################
# Задача 19
# Поменяйте значения переменных местами.
def Task_19():
    x = 'abc'
    y = 'xyz'
    temp = x
    x = y
    y = temp
    print("x =", x,"y =", y)

# Task_19()

##################################################################################
# Задача 20
# С помощью анонимной функции извлеките из списка числа, делимые на 15.
def Task_20():
    nums = [45, 55, 60, 37, 100, 105, 220]
    result = list(filter(lambda x: not x % 15, nums))
    print(result)

# Task_20()



##################################################################################
# my code :) or :| or :(
# It was easy for me
